TestEDT/src/Enums/СостоянияДокументовЭДО/СостоянияДокументовЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДокументовЭДО</name>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытПринудительно</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытСОтклонением</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытСОтклонениемПриглашения</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытСОшибкойПередачи</name>
  </enumValues>
  <enumValues>
    <name>НеПолучен</name>
  </enumValues>
  <enumValues>
    <name>НеСформирован</name>
  </enumValues>
  <enumValues>
    <name>ОбменЗавершен</name>
  </enumValues>
  <enumValues>
    <name>ОбменЗавершенСИсправлением</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяИзвещениеОПолучении</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяИзвещениеПоОтклонению</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяИсправление</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОтветНаПриглашение</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПередачаОператору</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПодтверждениеАннулирования</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПодтверждениеОператора</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяИзвещениеОПолучении</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяИзвещениеПоОтклонению</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяИсправлениеОшибкиПередачи</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяОтправка</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяОтправкаАннулирования</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяОтправкаИзвещения</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяОтправкаИзвещенияПоОтклонению</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяОтправкаОтклонения</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяОтправкаПриглашения</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПовторнаяОтправка</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодготовкаКОтправке</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодготовкаКОтправкеАннулирования</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодготовкаКОтправкеИзвещения</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодготовкаКОтправкеИзвещенияПоОтклонению</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодготовкаКОтправкеОтклонения</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодписание</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодписаниеАннулирования</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодписаниеИзвещения</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодписаниеИзвещенияПоОтклонению</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодписаниеОтклонения</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяПодтверждениеАннулирования</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяУтверждение</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяУточнение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОжидаетсяВыписка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОжидаетсяИзвещение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОжидаетсяИсполнение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОжидаетсяОтзыв</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОжидаетсяОтправкаПолучателю</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтклоненОператором</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежИсполнен</name>
  </enumValues>
  <enumValues>
    <name>УдалитьТребуетсяПодтверждение</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/Enums/ТипыЭлементовРегламентаЭДО/ТипыЭлементовРегламентаЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлементовРегламентаЭДО</name>
  <enumValues>
    <name>ИнформацияОтправителя</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияПолучателя</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияПолучателя_ПДО</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияПолучателя_ПДО_ИОП</name>
  </enumValues>
  <enumValues>
    <name>ИОП</name>
  </enumValues>
  <enumValues>
    <name>ИОП_ПДО</name>
  </enumValues>
  <enumValues>
    <name>ИОП_ПДО_ИОП</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ПДО</name>
  </enumValues>
  <enumValues>
    <name>ПДО_ИОП</name>
  </enumValues>
  <enumValues>
    <name>ПДП</name>
  </enumValues>
  <enumValues>
    <name>ПДП_ИОП</name>
  </enumValues>
  <enumValues>
    <name>ПОА</name>
  </enumValues>
  <enumValues>
    <name>ПОА_УОУ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАктЗаказчик</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДИСУКД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДОП</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДополнительныйЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДОПУПД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИнформацияПокупателяУКД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИнформацияПокупателяУПД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИПЭСФ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКСЧФДИСУКД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКСЧФУКД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПДОЭСФ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПДПЭСФ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПервичныйЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьСоглашениеОбИзмененииСтоимостиПолучатель</name>
  </enumValues>
  <enumValues>
    <name>УдалитьСЧФДОПУПД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьСЧФУПД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьТОРГ12Покупатель</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУУЭСФ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЭСФ</name>
  </enumValues>
  <enumValues>
    <name>УОУ</name>
  </enumValues>
  <enumValues>
    <name>УОУ_ИОП</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/Enums/СтатусыСообщенийЭДО/СтатусыСообщенийЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСообщенийЭДО</name>
  <enumValues>
    <name>НеПолучен</name>
  </enumValues>
  <enumValues>
    <name>НеСформирован</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>Подтвержден</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>Сформирован</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноПодписан</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАннулирован</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДоставлен</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДоставленоПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИсполнен</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКартотека2</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНеОтправлен</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОбработан</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтказанАБС</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтклонен</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтклоненБанком</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтклоненПолучателем</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтправкаЗаблокированаОператором</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтправленоИзвещение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтправленоПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтправленоПредложениеОбАннулировании</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОтправленоУведомление</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОшибкаПередачи</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОшибкаРеквизитов</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПереданОператору</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПодготовленоИзвещение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПодготовленоПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПолностьюПодписан</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПолученоИзвещение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПолученоПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПолученоПодтверждениеОператора</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПолученоПредложениеОбАннулировании</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПолученоУведомление</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПринят</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПриостановлен</name>
  </enumValues>
  <enumValues>
    <name>УдалитьСформированоПредложениеОбАннулировании</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЭПНеВерна</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/CommonModules/РегламентыЭДО_Неформализованный/Module.bsl
#Область СлужебныеПроцедурыИФункции

#Область ДляВызоваИзМодуляРегламентыЭДО

Функция СостояниеВходящегоДокумента(ПараметрыДокумента, СтатусыЭлементовРегламента) Экспорт
	
	Состояние = Перечисления.СостоянияДокументовЭДО.ПустаяСсылка();
	
	Если ЗаполнитьСостояниеПоИсходящемуОтклонению(ПараметрыДокумента, СтатусыЭлементовРегламента, Состояние)
		
		ИЛИ ЗаполнитьСостояниеПоПредложениюОбАннулировании(ПараметрыДокумента, СтатусыЭлементовРегламента, Состояние)
		
		ИЛИ ЗаполнитьСостояниеПоВходящейИнформацииОтправителя(ПараметрыДокумента, СтатусыЭлементовРегламента, Состояние)
		
		ИЛИ ЗаполнитьСостояниеПоИсходящемуИзвещениюОПолучении(
			ПараметрыДокумента, СтатусыЭлементовРегламента, Состояние)
		
		ИЛИ ЗначениеЗаполнено(Состояние) Тогда
		
		Возврат Состояние;
		
	ИначеЕсли ПараметрыДокумента.Исправлен Тогда
		
		Возврат Перечисления.СостоянияДокументовЭДО.ОбменЗавершенСИсправлением;
		
	КонецЕсли;
	
	Возврат Перечисления.СостоянияДокументовЭДО.ОбменЗавершен;
	
КонецФункции

Функция СостояниеИсходящегоДокумента(ПараметрыДокумента, СтатусыЭлементовРегламента) Экспорт
	
	Состояние = Перечисления.СостоянияДокументовЭДО.ПустаяСсылка();
	
	Если ЗаполнитьСостояниеПоИсходящейИнформацииОтправителя(ПараметрыДокумента, СтатусыЭлементовРегламента, Состояние)
		
		ИЛИ ЗаполнитьСостояниеПоПредложениюОбАннулировании(ПараметрыДокумента, СтатусыЭлементовРегламента, Состояние)
		
		ИЛИ ЗаполнитьСостояниеПоВходящемуОтклонению(ПараметрыДокумента, СтатусыЭлементовРегламента, Состояние)
		
		ИЛИ ЗаполнитьСостояниеПоПодтверждениюОператора(ПараметрыДокумента, СтатусыЭлементовРегламента, Состояние)
		
		ИЛИ ЗаполнитьСостояниеПоВходящемуИзвещениюОПолучении(ПараметрыДокумента, СтатусыЭлементовРегламента, Состояние)
		
		ИЛИ ЗначениеЗаполнено(Состояние) Тогда
		
		Возврат Состояние;
		
	ИначеЕсли ПараметрыДокумента.Исправлен Тогда
		
		Возврат Перечисления.СостоянияДокументовЭДО.ОбменЗавершенСИсправлением;
		
	КонецЕсли;
	
	Возврат Перечисления.СостоянияДокументовЭДО.ОбменЗавершен;
	
КонецФункции

Функция СостояниеСообщения(ПараметрыСообщения, ПараметрыДокумента, ИспользоватьУтверждение) Экспорт
	
	Если ПараметрыСообщения.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПОА Тогда
		Состояние = РегламентыЭДО.СостояниеСообщенияАннулирования(ПараметрыСообщения, ПараметрыДокумента);
	ИначеЕсли РегламентыЭДО.ЭтоСлужебноеСообщение(ПараметрыСообщения.ТипЭлементаРегламента) Тогда
		Состояние = РегламентыЭДО.СостояниеСлужебногоСообщения(ПараметрыСообщения, ПараметрыДокумента);
	Иначе
		Состояние = СостояниеСообщенияИнформацияОтправителя(ПараметрыСообщения, ПараметрыДокумента, ИспользоватьУтверждение);
	КонецЕсли;
	
	Возврат Состояние;
	
КонецФункции

Функция ДобавитьЭлементыСхемыРегламента(СхемаРегламента, НастройкиСхемыРегламента) Экспорт
	
	ЭлементыСхемы = Новый Соответствие;
	
	Если НастройкиСхемыРегламента.ЭтоВходящийЭДО Тогда
		ДобавитьЭлементыРегламентаПолучателя(СхемаРегламента, НастройкиСхемыРегламента, ЭлементыСхемы);
	Иначе
		ДобавитьЭлементыРегламентаОтправителя(СхемаРегламента, НастройкиСхемыРегламента, ЭлементыСхемы);
	КонецЕсли;
	
	ДобавитьЭлементыРегламентаАннулирования(ЭлементыСхемы);
	
	ДобавитьЭлементыРегламентаОтклонения(ЭлементыСхемы);
	
	Возврат ЭлементыСхемы;
	
КонецФункции

Функция ТипИзвещенияДляЭлементаВходящегоДокумента(ТипЭлементаРегламента) Экспорт
	Результат = Перечисления.ТипыЭлементовРегламентаЭДО.ПустаяСсылка();
	Если ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя Тогда
		Результат = Перечисления.ТипыЭлементовРегламентаЭДО.ИОП;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ТипИзвещенияДляЭлементаИсходящегоДокумента(ТипЭлементаРегламента) Экспорт
	Возврат Перечисления.ТипыЭлементовРегламентаЭДО.ПустаяСсылка();
КонецФункции

Функция ЕстьИнформацияПолучателя() Экспорт
	Возврат Ложь;
КонецФункции

#КонецОбласти

#Область СостояниеДокумента

Функция ЗаполнитьСостояниеПоПредложениюОбАннулировании(ПараметрыДокумента, СтатусыЭлементовРегламента, Состояние)
	
	ЭлементРегламента = Неопределено;
	
	Если Не РегламентыЭДО.ЕстьЭлементРегламента(СтатусыЭлементовРегламента,
		Перечисления.ТипыЭлементовРегламентаЭДО.ПОА, ЭлементРегламента) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Истина;
	
	ОтклонениеПОА = Неопределено;
	Если РегламентыЭДО.ЕстьЭлементРегламента(СтатусыЭлементовРегламента,
		Перечисления.ТипыЭлементовРегламентаЭДО.ПОА_УОУ, ОтклонениеПОА) Тогда
		
		Если ОтклонениеПОА.Состояние = Перечисления.СостоянияСообщенийЭДО.Подписание Тогда 
			
			Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеОтклонения;
			
		ИначеЕсли ОтклонениеПОА.Состояние = Перечисления.СостоянияСообщенийЭДО.ПодготовкаКОтправке Тогда 
			
			Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправкеОтклонения;
			
		ИначеЕсли ОтклонениеПОА.Состояние = Перечисления.СостоянияСообщенийЭДО.Отправка Тогда 
			
			Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправкаОтклонения;
			
		Иначе
			
			Результат = Ложь;
			
		КонецЕсли;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.Подтверждение Тогда
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодтверждениеАннулирования;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.Подписание Тогда
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеАннулирования;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.ПодготовкаКОтправке Тогда 
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправкеАннулирования;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.Отправка Тогда 
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправкаАннулирования;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.ОжидаетсяПодпись Тогда 
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеАннулирования;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.Хранение Тогда
		
		Состояние = Перечисления.СостоянияДокументовЭДО.Аннулирован;
		
	Иначе
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСостояниеПоИсходящемуОтклонению(ПараметрыДокумента, СтатусыЭлементовРегламента, Состояние)
	
	Результат = Истина;
	ЭлементРегламента = Неопределено;
	
	Если Не РегламентыЭДО.ЕстьЭлементРегламента(СтатусыЭлементовРегламента,
		Перечисления.ТипыЭлементовРегламентаЭДО.УОУ, ЭлементРегламента) Тогда
		
		Результат = Ложь;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.Подписание Тогда 
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеОтклонения;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.ПодготовкаКОтправке Тогда 
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправкеОтклонения;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.Отправка Тогда 
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправкаОтклонения;
		
	Иначе
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонением;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСостояниеПоВходящейИнформацииОтправителя(ПараметрыДокумента, СтатусыЭлементовРегламента, Состояние)
	
	Результат = Истина;
	ЭлементРегламента = Неопределено;
	
	Если Не РегламентыЭДО.ЕстьЭлементРегламента(СтатусыЭлементовРегламента,
		Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя, ЭлементРегламента) Тогда
		
		Состояние = Перечисления.СостоянияДокументовЭДО.НеПолучен;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.Утверждение Тогда
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяУтверждение;
		
	ИначеЕсли Не ПараметрыДокумента.ТребуетсяПодтверждение Тогда
		
		Результат = Ложь;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.Подписание Тогда
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.ПодготовкаКОтправке Тогда
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправке;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.Отправка Тогда
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправка;
		
	Иначе
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСостояниеПоИсходящемуИзвещениюОПолучении(ПараметрыДокумента, СтатусыЭлементовРегламента, Состояние)
	
	Если Не ПараметрыДокумента.ТребуетсяИзвещение Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Истина;
	ЭлементРегламента = Неопределено;
	
	Если Не РегламентыЭДО.ЕстьЭлементРегламента(СтатусыЭлементовРегламента,
		Перечисления.ТипыЭлементовРегламентаЭДО.ИОП, ЭлементРегламента) Тогда
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяИзвещениеОПолучении;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.Подписание Тогда 
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещения;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.ПодготовкаКОтправке Тогда 
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправкеИзвещения;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.Отправка Тогда 
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправкаИзвещения;
		
	Иначе
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСостояниеПоИсходящейИнформацииОтправителя(ПараметрыДокумента, СтатусыЭлементовРегламента, Состояние)
	
	Результат = Истина;
	ЭлементРегламента = Неопределено;
	
	Если Не РегламентыЭДО.ЕстьЭлементРегламента(СтатусыЭлементовРегламента,
		Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя, ЭлементРегламента) Тогда
		
		Состояние = РегламентыЭДО.НачальноеСостояниеДокумента();
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.Подписание Тогда
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписание;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.ПодготовкаКОтправке Тогда
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяПодготовкаКОтправке;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.Отправка Тогда
		
		Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяОтправка;
		
	ИначеЕсли ЭлементРегламента.Состояние = Перечисления.СостоянияСообщенийЭДО.ОжидаетсяПодпись Тогда
		
		Результат = Ложь;
		РегламентыЭДО.УстановитьПриоритетноеСостояние(Состояние, Перечисления.СостоянияДокументовЭДО.ОжидаетсяПодтверждение);
		
	Иначе
		
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСостояниеПоВходящемуОтклонению(ПараметрыДокумента, СтатусыЭлементовРегламента, Состояние)
	
	Результат = Ложь;
	
	Если РегламентыЭДО.ЕстьЭлементРегламента(СтатусыЭлементовРегламента,
		Перечисления.ТипыЭлементовРегламентаЭДО.УОУ) Тогда
		
		Результат = Истина;
		
		Если ПараметрыДокумента.Исправлен Тогда
			Состояние = Перечисления.СостоянияДокументовЭДО.ЗакрытСОтклонением;
		Иначе
			Состояние = Перечисления.СостоянияДокументовЭДО.ТребуетсяУточнение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСостояниеПоВходящемуИзвещениюОПолучении(ПараметрыДокумента, СтатусыЭлементовРегламента, Состояние)
	
	Результат = Ложь;
	
	Если ПараметрыДокумента.ТребуетсяИзвещение
		И Не РегламентыЭДО.ЕстьЭлементРегламента(СтатусыЭлементовРегламента,
		Перечисления.ТипыЭлементовРегламентаЭДО.ИОП) Тогда
		
		РегламентыЭДО.УстановитьПриоритетноеСостояние(Состояние, Перечисления.СостоянияДокументовЭДО.ОжидаетсяИзвещениеОПолучении);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСостояниеПоПодтверждениюОператора(ПараметрыДокумента, СтатусыЭлементовРегламента, Состояние)
	
	Если Не РегламентыЭДО.ЭтоОбменЧерезОператора(ПараметрыДокумента.СпособОбмена) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Результат = Ложь;
	
	Если Не РегламентыЭДО.ЕстьЭлементРегламента(СтатусыЭлементовРегламента,
		Перечисления.ТипыЭлементовРегламентаЭДО.ПДП) Тогда
		
		Результат = Истина;
		Состояние = Перечисления.СостоянияДокументовЭДО.ОжидаетсяПодтверждениеОператора;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СостояниеСообщения

Функция СостояниеСообщенияИнформацияОтправителя(ПараметрыСообщения, ПараметрыДокумента, ИспользоватьУтверждение)
	
	Состояние = Перечисления.СостоянияСообщенийЭДО.ПустаяСсылка();
	
	Статус = ПараметрыСообщения.Статус;
	
	Если Статус = Перечисления.СтатусыСообщенийЭДО.Получен Тогда
		
		Если ИспользоватьУтверждение Тогда
			Состояние = Перечисления.СостоянияСообщенийЭДО.Утверждение;
		ИначеЕсли Не ПараметрыДокумента.ТребуетсяПодтверждение
			ИЛИ ПараметрыДокумента.ОбменБезПодписи Тогда
			Состояние = Перечисления.СостоянияСообщенийЭДО.Хранение;
		Иначе
			Состояние = Перечисления.СостоянияСообщенийЭДО.Подписание;
		КонецЕсли;
		
	ИначеЕсли Статус = Перечисления.СтатусыСообщенийЭДО.Утвержден Тогда
		
		Если Не ПараметрыДокумента.ТребуетсяПодтверждение
			ИЛИ ПараметрыДокумента.ОбменБезПодписи Тогда
			Состояние = Перечисления.СостоянияСообщенийЭДО.Хранение;
		Иначе
			Состояние = Перечисления.СостоянияСообщенийЭДО.Подписание;
		КонецЕсли;
		
	ИначеЕсли Статус = Перечисления.СтатусыСообщенийЭДО.Сформирован Тогда
		
		Если ПараметрыДокумента.ОбменБезПодписи Тогда
			Состояние = Перечисления.СостоянияСообщенийЭДО.Отправка;
		Иначе
			Состояние = Перечисления.СостоянияСообщенийЭДО.Подписание;
		КонецЕсли;
		
	ИначеЕсли Статус = Перечисления.СтатусыСообщенийЭДО.ЧастичноПодписан Тогда
		
		Состояние = Перечисления.СостоянияСообщенийЭДО.Подписание;
		
	ИначеЕсли Статус = Перечисления.СтатусыСообщенийЭДО.Подписан Тогда
		
		Если РегламентыЭДО.ЭтоВнутреннийОбмен(ПараметрыДокумента.СпособОбмена) Тогда
			Состояние = Перечисления.СостоянияСообщенийЭДО.Хранение;
		Иначе
			Состояние = Перечисления.СостоянияСообщенийЭДО.ПодготовкаКОтправке;
		КонецЕсли;
		
	ИначеЕсли Статус = Перечисления.СтатусыСообщенийЭДО.ПодготовленКОтправке Тогда
		
		Состояние = Перечисления.СостоянияСообщенийЭДО.Отправка;
		
	ИначеЕсли Статус = Перечисления.СтатусыСообщенийЭДО.Отправлен Тогда
		
		Если ПараметрыСообщения.Направление = Перечисления.НаправленияЭДО.Входящий
			ИЛИ Не ПараметрыДокумента.ТребуетсяПодтверждение
			ИЛИ ПараметрыДокумента.ОбменБезПодписи Тогда
			Состояние = Перечисления.СостоянияСообщенийЭДО.Хранение;
		Иначе
			Состояние = Перечисления.СостоянияСообщенийЭДО.ОжидаетсяПодпись;
		КонецЕсли;
		
	ИначеЕсли Статус = Перечисления.СтатусыСообщенийЭДО.Подтвержден Тогда
		
		Состояние = Перечисления.СостоянияСообщенийЭДО.Хранение;
		
	Иначе
		ВызватьИсключение РегламентыЭДО.ТекстОшибкиНекорректныйСтатусДокумента();
	КонецЕсли;
	
	Возврат Состояние;
	
КонецФункции

#КонецОбласти

#Область ДобавитьЭлементыСхемыРегламента

Процедура ДобавитьЭлементыРегламентаОтправителя(СхемаРегламента, НастройкиСхемыРегламента, ЭлементыСхемы)
	
	ИнформацияОтправителя = РегламентыЭДО.ВставитьЭлементСхемыРегламента(ЭлементыСхемы, СхемаРегламента,
		Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
		
	Если РегламентыЭДО.ЭтоОбменЧерезОператора(НастройкиСхемыРегламента.СпособОбмена) Тогда
		
		РегламентыЭДО.ВставитьЭлементСхемыРегламента(ЭлементыСхемы, ИнформацияОтправителя,
			Перечисления.ТипыЭлементовРегламентаЭДО.ПДП);
		
	КонецЕсли;
	
	РегламентыЭДО.ВставитьЭлементСхемыРегламента(ЭлементыСхемы, ИнформацияОтправителя,
		Перечисления.ТипыЭлементовРегламентаЭДО.ИОП,
		Не НастройкиСхемыРегламента.ТребуетсяИзвещение);
	
КонецПроцедуры

Процедура ДобавитьЭлементыРегламентаПолучателя(СхемаРегламента, НастройкиСхемыРегламента, ЭлементыСхемы)
	
	ИнформацияОтправителя = РегламентыЭДО.ВставитьЭлементСхемыРегламента(ЭлементыСхемы, СхемаРегламента,
		Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
	
	РегламентыЭДО.ВставитьЭлементСхемыРегламента(ЭлементыСхемы, ИнформацияОтправителя,
		Перечисления.ТипыЭлементовРегламентаЭДО.ИОП,
		Не НастройкиСхемыРегламента.ТребуетсяИзвещение);
	
КонецПроцедуры

Процедура ДобавитьЭлементыРегламентаАннулирования(ЭлементыСхемы)
	
	ИнформацияОтправителя = ЭлементыСхемы[Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя];
	Если ИнформацияОтправителя = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПОА = РегламентыЭДО.ВставитьЭлементСхемыРегламента(ЭлементыСхемы, ИнформацияОтправителя,
		Перечисления.ТипыЭлементовРегламентаЭДО.ПОА, Истина);
	
	РегламентыЭДО.ВставитьЭлементСхемыРегламента(ЭлементыСхемы, ПОА,
		Перечисления.ТипыЭлементовРегламентаЭДО.ПОА_УОУ, Истина);
	
КонецПроцедуры

Процедура ДобавитьЭлементыРегламентаОтклонения(ЭлементыСхемы)
	
	ИнформацияОтправителя = ЭлементыСхемы[Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя];
	Если ИнформацияОтправителя = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегламентыЭДО.ВставитьЭлементСхемыРегламента(ЭлементыСхемы, ИнформацияОтправителя,
		Перечисления.ТипыЭлементовРегламентаЭДО.УОУ, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
